[
    {
        "title": "Coffee - Wikipedia",
        "url": "https://en.wikipedia.org/wiki/Coffee",
        "description": "The earliest credible evidence of coffee drinking as the modern beverage appears in modern-day Yemen in southern Arabia in the middle of the 15th century in ...",
        "text": "\n\n\nCoffee is a beverage brewed from roasted coffee beans. Darkly colored, bitter, and slightly acidic, coffee has a stimulating effect on humans, primarily due to its caffeine content. It has the highest sales in the world market for hot drinks.[2]\n\n\nThe seeds of the Coffea plant's fruits are separated to produce unroasted green coffee beans. The beans are roasted and then ground into fine particles typically steeped in hot water before being filtered out, producing a cup of coffee. It is usually served hot, although chilled or iced coffee is common. Coffee can be prepared and presented in a variety of ways (e.g., espresso, French press, caffè latte, or already-brewed canned coffee). Sugar, sugar substitutes, milk, and cream are often added to mask the bitter taste or enhance the flavor.\n\n\nThough coffee is now a global commodity, it has a long history tied closely to food traditions around the Red Sea. The earliest credible evidence of coffee drinking as the modern beverage appears in modern-day Yemen in southern Arabia in the middle of the 15th century in Sufi shrines, where coffee seeds were first roasted and brewed in a manner similar to how it is now prepared for drinking.[3] The coffee beans were procured by the Yemenis from the Ethiopian Highlands via coastal Somali intermediaries, and cultivated in Yemen. By the 16th century, the drink had reached the rest of the Middle East and North Africa, later spreading to Europe.\n\n\nThe two most commonly grown coffee bean types are C. arabica and C. robusta.[4] Coffee plants are cultivated in over 70 countries, primarily in the equatorial regions of the Americas, Southeast Asia, the Indian subcontinent, and Africa. As of 2023[update], Brazil was the leading grower of coffee beans, producing 35% of the world's total. Green, unroasted coffee is traded as an agricultural commodity. Despite coffee sales reaching billions of dollars worldwide, farmers producing coffee beans disproportionately live in poverty. Critics of the coffee industry have also pointed to its negative impact on the environment and the clearing of land for coffee-growing and water use. The global coffee industry is massive and worth $495.50 billion as of 2023.[5] Brazil, Vietnam, and Colombia are the top exporters of coffee beans as of 2023.\n\n\nThe word coffee entered the English language in 1582 via the Dutch koffie, borrowed from the Ottoman Turkish kahve (قهوه), borrowed in turn from the Arabic qahwah (قَهْوَة).[6] Medieval Arab lexicographers traditionally held that the etymology of qahwah meant 'wine', given its distinctly dark color, and was derived from the verb qahiya (قَهِيَ), 'to have no appetite'.[7] The word qahwah most likely meant 'the dark one', referring to the brew or the bean; qahwah is not the name of the bean, which are known in Arabic as bunn and in Cushitic languages as būn. Semitic languages had the root qhh, 'dark color', which became a natural designation for the beverage. Its cognates include the Hebrew qehe(h) ('dulling') and the Aramaic qahey ('give acrid taste to').[7] Although etymologists have connected it with a word meaning \"wine\", it is also thought to be from the Kaffa region of Ethiopia.[8]\n\n\nThe terms coffee pot and coffee break originated in 1705 and 1952, respectively.[9]\n\n\nThere are multiple anecdotal origin stories which lack evidence. In a commonly repeated legend, Kaldi, a 9th-century Ethiopian goatherd, first observed the coffee plant after seeing his flock energized by chewing on the plant.[3] This legend does not appear before 1671, first being related by Antoine Faustus Nairon, a Maronite professor of Oriental languages and author of one of the first printed treatises devoted to coffee, De Saluberrima potione Cahue seu Cafe nuncupata Discurscus (Rome, 1671), indicating the story is likely apocryphal.[10][11][3] Another legend attributes the discovery of coffee to a Sheikh Omar. Starving after being exiled from Mokha (a port city in what is now Yemen), Omar found berries. After attempting to chew and roast them, Omar boiled them, which yielded a liquid that revitalized and sustained him.[12]\n\n\nThe earliest credible evidence of coffee drinking or knowledge of the coffee tree appears in the middle of the 15th century in the accounts of Ahmed al-Ghaffar in Yemen,[3] where coffee seeds were first roasted and brewed in a similar way to how it is prepared now. Coffee was used by Sufi circles to stay awake for their religious rituals.[13] Accounts differ on the origin of the coffee plant before its appearance in Yemen. From Ethiopia, coffee could have been introduced to Yemen via trade across the Red Sea.[14] One account credits Muhammad Ibn Sa'd for bringing the beverage to Aden from the African coast,[15] other early accounts say Ali ben Omar of the Shadhili Sufi order was the first to introduce coffee to Arabia.[15][16]\n\n\n16th-century Islamic scholar Ibn Hajar al-Haytami notes in his writings that a beverage called qahwa developed from a tree in the Zeila region located in the Horn of Africa.[13] Coffee was first exported from Ethiopia to Yemen by Somali merchants from Berbera and Zeila in modern-day Somaliland, which was procured from Harar and the Abyssinian interior. According to Captain Haines, who was the colonial administrator of Aden (1839–1854), Mokha historically imported up to two-thirds of its coffee from Berbera-based merchants before the coffee trade of Mokha was captured by British-controlled Aden in the 19th century. After that, much of the Ethiopian coffee was exported to Aden via Berbera.[17]\n\n\nBy the 16th century, coffee had reached the rest of the Middle East and North Africa.[18] The first coffee seeds were smuggled out of the Middle East by Sufi Baba Budan from Yemen to India during the time. Before then, all exported coffee was boiled or otherwise sterilized. Portraits of Baba Budan depict him as having smuggled seven coffee seeds by strapping them to his chest. The first plants from these smuggled seeds were planted in Mysore.\n\n\nCoffee had spread to Italy by 1600 and then to the rest of Europe, Indonesia, and the Americas.[19][better source needed]\n\n\nIn 1583, Leonhard Rauwolf, a German physician, gave this description of coffee after returning from a ten-year trip to the Near East:\n\n\nA beverage as black as ink, useful against numerous illnesses, particularly those of the stomach. Its consumers take it in the morning, quite frankly, in a porcelain cup passed around and from which each one drinks a cupful. It is composed of water and the fruit from a bush called bunnu.\n\nThriving trade brought many goods, including coffee, from the Ottoman Empire to Venice. From there it was introduced to the rest of Europe. Coffee became more widely accepted after it was deemed a Christian beverage by Pope Clement VIII in 1600, despite appeals to ban the \"Muslim drink\". The first European coffee house opened in Venice in 1647.[20]\n\n\nThe Dutch East India Company was the first to import coffee on a large scale.[21] The Dutch later grew the crop in Java and Ceylon.[22] The first exports of Indonesian coffee from Java to the Netherlands occurred in 1711.[23]\n\n\nThrough the efforts of the British East India Company, coffee also became popular in England. In a diary entry of May 1637, John Evelyn recorded tasting the drink at Oxford in England, where it had been brought by a student of Balliol College from Crete named Nathaniel Conopios of Crete.[24][25] Oxford's Queen's Lane Coffee House, established in 1654, is still in existence today. Coffee was introduced in France in 1657 and in Austria and Poland after the 1683 Battle of Vienna, when coffee was captured from supplies of the defeated Turks.[26]\n\n\nWhen coffee reached North America during the Colonial period, it was initially not as successful as in Europe, as alcoholic beverages remained more popular. During the Revolutionary War, the demand for coffee increased so much that dealers had to hoard their scarce supplies and raise prices dramatically; this was also due to the reduced availability of tea from British merchants,[27] and a general resolution among many Americans to avoid drinking tea following the 1773 Boston Tea Party.[28] After the War of 1812, during which Britain temporarily cut off access to tea imports, the Americans' taste for coffee grew.\n\n\nDuring the 18th century, coffee consumption declined in Britain, giving way to tea drinking. The latter beverage was simpler to make and had become cheaper with the British conquest of India and the tea industry there.[29] During the Age of Sail, seamen aboard ships of the British Royal Navy made substitute coffee by dissolving burnt bread in hot water.[30]\n\n\nThe Frenchman Gabriel de Clieu took a coffee plant to the French territory of Martinique in the Caribbean in the 1720s,[31] from which much of the world's cultivated arabica coffee is descended. Coffee thrived in the climate and was conveyed across the Americas.[32] Coffee was cultivated in Saint-Domingue (now Haiti) from 1734, and by 1788 it supplied half the world's coffee.[33] The conditions that the enslaved people worked in on coffee plantations were a factor in the soon to follow Haitian Revolution. The coffee industry never fully recovered there.[34] It made a brief come-back in 1949 when Haiti was the world's third largest coffee exporter, but declined rapidly after that.\n\n\nMeanwhile, coffee had been introduced to Brazil in 1727, although its cultivation did not gather momentum until independence in 1822.[35] After this time, massive tracts of rainforest were cleared for coffee plantations, first in the vicinity of Rio de Janeiro and later São Paulo.[36] Brazil went from having essentially no coffee exports in 1800 to being a significant regional producer in 1830, to being the largest producer in the world by 1852. In 1910–1920, Brazil exported around 70% of the world's coffee, Colombia, Guatemala, and Venezuela exported 15%, and Old World production accounted for less than 5% of world exports.[37]\n\n\nMany countries in Central America took up cultivation in the latter half of the 19th century, and almost all were involved in the large-scale displacement and exploitation of the indigenous people[citation needed]. Harsh conditions led to many uprisings, coups, and bloody suppression of peasants.[38] The notable exception was Costa Rica, where lack of ready labor prevented the formation of large farms. Smaller farms and more egalitarian conditions ameliorated unrest over the 19th and 20th centuries.[39]\n\n\nRapid growth in coffee production in South America during the second half of the 19th century was matched by an increase in consumption in developed countries, though nowhere has this growth been as pronounced as in the United States, where a high rate of population growth was compounded by doubling of per capita consumption between 1860 and 1920. Though the United States was not the heaviest coffee-drinking nation at the time (Belgium, the Netherlands and Nordic countries all had comparable or higher levels of per capita consumption), due to its sheer size, it was already the largest consumer of coffee in the world by 1860, and, by 1920, around half of all coffee produced worldwide was consumed in the US.[37]\n\n\nCoffee has become a vital cash crop for many developing countries. Over one hundred million people in developing countries have become dependent on coffee as their primary source of income. It has become the primary export and economic backbone for African countries like Uganda, Burundi, Rwanda, and Ethiopia,[40] as well as many Central American countries.\n\n\nSeveral species of shrub of the genus Coffea produce the berries from which coffee is extracted. The two main species commercially cultivated are Coffea canephora (predominantly a form known as 'robusta') and C. arabica.[41] C. arabica, the most highly regarded species, is native to the southwestern highlands of Ethiopia and the Boma Plateau in southeastern Sudan and Mount Marsabit in northern Kenya.[42] C. canephora is native to western and central Subsaharan Africa, from Guinea to Uganda and southern Sudan.[43] Less popular species are C. liberica, C. stenophylla, C. mauritiana, and C. racemosa.\n\n\nAll coffee plants are classified in the large family Rubiaceae. They are evergreen shrubs or trees that may grow 5 m (15 ft) tall when unpruned. The leaves are dark green and glossy, usually 10–15 cm (4–6 in) long and 6 cm (2.4 in) wide, simple, entire, and opposite. Petioles of opposite leaves fuse at the base to form interpetiolar stipules, characteristic of Rubiaceae. The flowers are axillary, and clusters of fragrant white flowers bloom simultaneously. Gynoecium consists of an inferior ovary, also characteristic of Rubiaceae. The flowers are followed by oval berries of about 1.5 cm (0.6 in).[44] When immature, they are green, and they ripen to yellow, then crimson, before turning black on drying. Each berry usually contains two seeds, but 5–10% of the berries[45] have only one; these are called peaberries.[46] Arabica berries ripen in six to eight months, while robusta takes nine to eleven months.[47]\n\n\nCoffea arabica is predominantly self-pollinating, and as a result, the seedlings are generally uniform and vary little from their parents. In contrast, Coffea canephora, and C. liberica are self-incompatible and require outcrossing. This means that useful forms and hybrids must be propagated vegetatively.[48] Cuttings, grafting, and budding are the usual methods of vegetative propagation.[49] On the other hand, there is great scope for experimentation in search of potential new strains.[48]\n\n\nThe traditional method of planting coffee is to place 20 seeds in each hole at the beginning of the rainy season. This method loses about 50% of the seeds' potential, as about half fail to sprout. A more effective process of growing coffee, used in Brazil, is to raise seedlings in nurseries that are then planted outside after six to twelve months. Coffee is often intercropped with food crops, such as corn, beans, or rice during the first few years of cultivation as farmers become familiar with its requirements.[44] Coffee plants grow within a defined area between the tropics of Cancer and Capricorn, termed the bean belt or coffee belt.[50]\n\n\nIn 2020, the world production of green coffee beans was 175,647,000 60 kg bags, led by Brazil with 39% of the total, followed by Vietnam, Colombia, and Indonesia.[51] Brazil is the largest coffee exporting nation, accounting for 15% of all world exports in 2019.[52] As of 2021, no synthetic coffee products are publicly available but multiple bioeconomy companies have reportedly produced first batches that are highly similar on the molecular level and are close to commercialization.[53][54][55]\n\n\nOf the two main species grown, arabica coffee (from C. arabica) is generally more highly regarded than robusta coffee (from C. canephora). Robusta coffee tends to be bitter and has less flavor but a better body than arabica. For these reasons, about three-quarters of coffee cultivated worldwide is C. arabica.[41] Robusta strains also contain about 40–50% more caffeine than arabica.[56] Consequently, this species is used as an inexpensive substitute for arabica in many commercial coffee blends. Good quality robusta beans are used in traditional Italian espresso blends to provide a full-bodied taste and a better foam head (known as crema).\n\n\nAdditionally, Coffea canephora is less susceptible to disease than C. arabica and can be cultivated in lower altitudes and warmer climates where C. arabica will not thrive.[57] The robusta strain was first collected in 1890 from the Lomani River, a tributary of the Congo River, and was conveyed from the Congo Free State (now the Democratic Republic of the Congo) to Brussels to Java around 1900. From Java, further breeding resulted in the establishment of robusta plantations in many countries.[58] In particular, the spread of the devastating coffee leaf rust (Hemileia vastatrix), to which C. arabica is vulnerable, hastened the uptake of the resistant robusta. Hemileia vastatrix is a fungal pathogen[59] and results in light, rust-colored spots on the undersides of coffee plant leaves. Hemileia vastatrix grows exclusively on the leaves of coffee plants.[60] Coffee leaf rust is found in virtually all countries that produce coffee.[61]\n\n\nBeans from different countries or regions can usually be distinguished by differences in flavor, aroma, body, and acidity.[62] These taste characteristics are dependent not only on the coffee's growing region but also on genetic subspecies (varietals) and processing.[63] Varietals are generally known by the region in which they are grown, such as Colombian, Java, and Kona. Arabica coffee beans are cultivated mainly in Latin America, eastern Africa or Asia, while robusta beans are grown in central Africa, southeast Asia, and Brazil.[41]\n\n\nCoffee can also be blended with medicinal or functional mushrooms, of which some of the most frequently used include: lion's mane, chaga, cordyceps and reishi.[64] Mushroom coffee has about half the caffeine of standard coffee.[65] However, drinking mushroom coffee can result in digestive issues and high amounts can result in liver toxicity.[65] There is little clinical evidence for the benefits of mushroom coffee.[66]\n\n\nMycena citricolor, commonly referred to as American Leaf Spot, is a fungus that can affect the whole coffee plant. It can grow on leaves, resulting in leaves with holes that often fall from the plant. It is a threat primarily in Latin America.[67]\n\n\nOver 900 species of insect have been recorded as pests of coffee crops worldwide. Of these, over a third are beetles, and over a quarter are bugs. Some 20 species of nematodes, 9 species of mites, and several snails and slugs also attack the crop. Birds and rodents sometimes eat coffee berries, but their impact is minor compared to invertebrates.[68] In general, arabica is the more sensitive species to invertebrate predation overall. Each part of the coffee plant is assailed by different animals. Nematodes attack the roots, coffee borer beetles burrow into stems and woody material,[69] and the foliage is attacked by over 100 species of larvae (caterpillars) of butterflies and moths.[70]\n\n\nMass spraying of insecticides has often proven disastrous, as predators of the pests are more sensitive than the pests themselves.[71] Instead, integrated pest management has developed, using techniques such as targeted treatment of pest outbreaks, and managing crop environment away from conditions favoring pests. Branches infested with scale are often cut and left on the ground, which causes scale parasites to not only attack the scale on the fallen branches but in the plant as well.[72]\n\n\nThe 2-mm-long coffee borer beetle (Hypothenemus hampei) is the most damaging insect pest to the world's coffee industry, destroying up to 50 percent or more of the coffee berries on plantations in most coffee-producing countries. The adult female beetle nibbles a single tiny hole in a coffee berry and lays 35 to 50 eggs. Inside, the offspring grow, mate, and then emerge from the commercially ruined berry to disperse, repeating the cycle. Pesticides are mostly ineffective because the beetle juveniles are protected inside the berry nurseries, but they are vulnerable to predation by birds when they emerge. When groves of trees are nearby, the American yellow warbler, rufous-capped warbler, and other insectivorous birds have been shown to reduce by 50 percent the number of coffee berry borers in Costa Rica coffee plantations.[73]\n\n\nOriginally, coffee was grown in the shade of trees that provided a habitat for many animals and insects.[74] Remnant forest trees were used for this purpose, but many species have been planted as well. These include leguminous trees of the genera Acacia, Albizia, Cassia, Erythrina, Gliricidia, Inga, and Leucaena, as well as the nitrogen-fixing non-legume sheoaks of the genus Casuarina, and the silky oak Grevillea robusta.[75]\n\n\nThis method is commonly called \"shade-grown coffee\". Starting in the 1970s, many farmers switched their production method to sun cultivation, in which coffee is grown in rows under full sun with little or no forest canopy. This causes berries to ripen more rapidly and bushes to produce higher yields, but requires the clearing of trees and increased use of fertilizer and pesticides, which damage the environment and cause health problems.[76]\n\n\nUnshaded coffee plants grown with fertilizer yield the most coffee, although unfertilized shaded crops generally yield more than unfertilized unshaded crops: the response to fertilizer is much greater in full sun.[77] While traditional coffee production causes berries to ripen more slowly and produce lower yields, the quality of the coffee is allegedly superior.[78] In addition, the traditional shaded method provides living space for many wildlife species. Proponents of shade cultivation say environmental problems such as deforestation, pesticide pollution, habitat destruction, and soil and water degradation are the side effects of the practices employed in sun cultivation.[74][79]\n\n\nThe American Birding Association, Smithsonian Migratory Bird Center,[80] National Arbor Day Foundation,[81] and the Rainforest Alliance have led a campaign for 'shade-grown' and organic coffees, which can be sustainably harvested.[82] Shaded coffee cultivation systems show greater biodiversity than full-sun systems, and those more distant from continuous forest compare rather poorly to undisturbed native forest in terms of habitat value for some bird species.[83][84]\n\n\nCoffee production uses a large volume of water. On average it takes about 140 litres (37 US gal) of water to grow the coffee beans needed to produce one cup of coffee. Growing the plants needed to produce 1 kg (2.2 lb) of roasted coffee in Africa, South America or Asia requires 26,400 litres (7,000 US gal) of water.[85] As with many other forms of agriculture, often much of this is rainwater, much of which would otherwise run off into rivers or coastlines, while much water actually absorbed by the plants is transpired straight back into the local environment through the plants' leaves (especially for cooling effects); broad estimates aside, consequential margins vary considerably based on details of local geography and horticultural practice. Coffee is often grown in countries where there is a water shortage, such as Ethiopia.[86]\n\n\nUsed coffee grounds may be used for composting or as a mulch. They are especially appreciated by worms and acid-loving plants such as blueberries.[87] Climate change may significantly impact coffee yields during the 21st century, such as in Nicaragua and Ethiopia which could lose more than half of the farming land suitable for growing (Arabica) coffee.[88][89][90] As of 2016, at least 34% of global coffee production was compliant with voluntary sustainability standards such as Fairtrade, UTZ, and 4C (The Common Code for the Coffee Community).[91]\n\n\nCoffee berries are traditionally selectively picked by hand, which is labor-intensive as it involves the selection of only the berries at the peak of ripeness. More commonly, crops are strip picked, where all berries are harvested simultaneously regardless of ripeness by person or machine. After picking, green coffee is processed by one of two types of method—a dry process method which is often simpler and less labor-intensive, and a wet process method, which incorporates batch fermentation, uses larger amounts of water in the process, and often yields a milder coffee.[92]\n\n\nThen they are sorted by ripeness and color, and most often the flesh of the berry is removed, usually by machine, and the seeds are fermented to remove the slimy layer of mucilage still present on the seed. When the fermentation is finished, the seeds are washed with large quantities of fresh water to remove the fermentation residue, which generates massive amounts of coffee wastewater. Finally, the seeds are dried.[93]\n\n\nThe best (but least used) method of drying coffee is using drying tables. In this method, the pulped and fermented coffee is spread thinly on raised beds, which allows the air to pass on all sides of the coffee, and then the coffee is mixed by hand. The drying that then takes place is more uniform, and fermentation is less likely. Most African coffee is dried in this manner and certain coffee farms around the world are starting to use this traditional method.[93] Next, the coffee is sorted, and labeled as green coffee. Some companies use cylinders to pump in heated air to dry the coffee seeds, though this is generally in places where the humidity is very high.[93]\n\n\nAn Asian coffee known as kopi luwak undergoes a peculiar process made from coffee berries eaten by the Asian palm civet, passing through its digestive tract, with the beans eventually harvested from feces. Coffee brewed from this process[94] is among the most expensive in the world, with bean prices reaching $160 per pound or $30 per brewed cup.[95] Kopi luwak coffee is said to have a uniquely rich, slightly smoky aroma and flavor with hints of chocolate, resulting from the action of digestive enzymes breaking down bean proteins to facilitate partial fermentation.[94][95] In Thailand, black ivory coffee beans are fed to elephants whose digestive enzymes reduce the bitter taste of beans collected from dung.[96] These beans sell for up to $1,100 a kilogram ($500 per lb), achieving the world's most expensive coffee,[96] three times costlier than palm civet coffee beans.[95]\n\n\nThe next step in the process is the roasting of green coffee. Coffee is usually sold in a roasted state, and with rare exceptions, such as infusions from green coffee beans,[97] coffee is roasted before it is consumed. It can be sold roasted by the supplier, or it can be home roasted.[98] The roasting process influences the taste of the beverage by changing the coffee bean both physically and chemically. The bean decreases in weight as moisture is lost and increases in volume, causing it to become less dense. The density of the bean also influences the strength of the coffee and the requirements for packaging.\n\n\nThe actual roasting begins when the temperature inside the bean reaches approximately 200 °C (392 °F), though different varieties of seeds differ in moisture and density and therefore roast at different rates.[99] During roasting, caramelization occurs as intense heat breaks down starches, changing them to simple sugars that begin to brown, which darkens the color of the bean.[100]\n\n\nSucrose is rapidly lost during the roasting process, and may disappear entirely in darker roasts. During roasting, aromatic oils and acids weaken, changing the flavor; at 205 °C (401 °F), other oils start to develop.[99] One of these oils, caffeol, is created at about 200 °C (392 °F), and is largely responsible for coffee's aroma and flavor.[22] The difference of caffeine content between a light roast and a dark roast is only about 0.1%.[101]\n\n\nDepending on the color of the roasted beans as perceived by the human eye, they will be labeled as light, medium light, medium, medium dark, dark, or very dark. A more accurate method of discerning the degree of roast involves measuring the reflected light from roasted seeds illuminated with a light source in the near-infrared spectrum. This elaborate light meter uses a process known as spectroscopy to return a number that consistently indicates the roasted coffee's relative degree of roast or flavor development. Coffee has, in many countries, been graded by size longer than it has been graded by quality. Grading is generally done with sieves, numbered to indicate the size of the perforations.[102]\n\n\nThe degree of roast affects coffee flavor and body. The color of coffee after brewing is also affected by the degree of roasting.[103] Darker roasts are generally bolder because they have less fiber content and a more sugary flavor. Lighter roasts have a more complex and therefore perceived stronger flavor from aromatic oils and acids otherwise destroyed by longer roasting times.[104] Roasting does not alter the amount of caffeine in the bean, but does give less caffeine when the beans are measured by volume because the beans expand during roasting.[105] A small amount of chaff is produced during roasting from the skin left on the seed after processing.[106] Chaff is usually removed from the seeds by air movement, though a small amount is added to dark roast coffees to soak up oils on the seeds.[99]\n\n\nDecaffeination of coffee seeds is done while the seeds are still green. Many methods can remove caffeine from coffee, but all involve either soaking the green seeds in hot water (often called the \"Swiss water process\")[107] or steaming them, then using a solvent to dissolve caffeine-containing oils.[22] Decaffeination is often done by processing companies, and the extracted caffeine is usually sold to the pharmaceutical industry.[22]\n\n\nCoffee is best stored in an airtight container made of ceramic, glass or non-reactive metal.[108] Higher quality prepackaged coffee usually has a one-way valve that prevents air from entering while allowing the coffee to release gases.[109] Coffee freshness and flavor is preserved when it is stored away from moisture, heat, and light. The tendency of coffee to absorb strong smells from food means that it should be kept away from such smells. Storage of coffee in refrigerators is not recommended due to the presence of moisture which can cause deterioration. Exterior walls of buildings that face the sun may heat the interior of a home, and this heat may damage coffee stored near such a wall. Heat from nearby ovens also harms stored coffee.[108]\n\n\nIn 1931, a method of packing coffee in a sealed vacuum in cans was introduced. The roasted coffee was packed and then 99% of the air was removed, allowing the coffee to be stored indefinitely until the can was opened. Today this method is in mass use for coffee in a large part of the world.[110]\n\n\nCoffee beans must be ground and brewed to create a beverage. The criteria for choosing a method include flavor and economy. Almost all methods of preparing coffee require that the beans be ground and then mixed with hot water long enough to allow the flavor to emerge but not so long as to draw out bitter compounds. The liquid can be consumed after the spent grounds are removed. Brewing considerations include the fineness of the grind, how the water is used to extract the flavor, the ratio of coffee grounds to water (the brew ratio), additional flavorings such as sugar, milk, and spices, and the technique to be used to separate spent grounds. Optimal coffee extraction occurs between 91 and 96 °C (196 and 205 °F).[111] Ideal holding temperatures range from 85 to 88 °C (185 to 190 °F) to as high as 93 °C (199 °F) and the ideal serving temperature is 68 to 79 °C (154 to 174 °F).[112]\n\n\nCoffee beans may be ground in various ways. A burr grinder uses revolving elements to shear the seed; a blade grinder cuts the seeds with blades moving at high speed, and a mortar and pestle crush the seeds. For most brewing methods a burr grinder is deemed superior because the grind is more even and the grind size can be adjusted.[113] The type of grind is often named after the brewing method for which it is generally used. Turkish grind is the finest grind, while coffee percolator or French press are the coarsest grinds. The most common grinds are between these two extremes: a medium grind is used in most home coffee-brewing machines.[114]\n\n\nCoffee may be brewed by several methods. It may be boiled, steeped, or pressurized.\n\n\nBrewing coffee by boiling was the earliest method, and Turkish coffee is an example of this method. It is prepared by grinding or pounding the seeds to a fine powder, then adding it to water and bringing it to a boil for no more than an instant in a pot called a cezve or, in Greek, a μπρίκι: bríki (from Turkish ibrik). This produces a strong coffee with a layer of foam on the surface and sediment (which is not meant for drinking) settling at the bottom of the cup.[115]\n\n\nDrip brewers and automatic coffeemakers brew coffee using gravity. In an automatic coffeemaker, hot water drips onto coffee grounds that are held in a paper, plastic, or perforated metal coffee filter, allowing the water to seep through the ground coffee while extracting its oils and essences. The liquid drips through the coffee and the filter into a carafe or pot, and the spent coffee grounds are retained in the filter.[116]\n\n\nIn a coffee percolator, water is pulled under a pipe by gravity, which is then forced into a chamber above a filter by steam pressure created by boiling. The water then seeps through the grounds, and the process is repeated until terminated by removing from the heat, by an internal timer,[117] or by a thermostat that turns off the heater when the entire pot reaches a certain temperature.\n\n\nThe espresso method forces hot pressurized water through finely-ground coffee.[114] As a result of brewing under high pressure (typically 9 bar),[118] the espresso beverage is more concentrated (as much as 10 to 15 times the quantity of coffee to water as gravity-brewing methods can produce) and has a more complex physical and chemical constitution.[119] A well-prepared espresso has a reddish-brown foam called crema that floats on the surface.[114] Other pressurized water methods include the moka pot and vacuum coffee maker. The AeroPress also works similarly, moving a column of water through a bed of coffee.\n\n\nCold brew coffee is made by steeping coarsely ground beans in cold water for several hours, then filtering them.[120] This results in a brew lower in acidity than most hot-brewing methods.\n\n\nOnce brewed, coffee may be served in a variety of ways. Drip-brewed, percolated, or French-pressed/cafetière coffee may be served as white coffee with a dairy product such as milk or cream, or dairy substitute, or as black coffee with no such addition. It may be sweetened with sugar or artificial sweetener. When served cold, it is called iced coffee.\n\n\nEspresso-based coffee has a variety of possible presentations. In its most basic form, an espresso is served alone as a shot or short black, or with hot water added, when it is known as Caffè Americano. A long black is made by pouring a double espresso into an equal portion of water, retaining the crema, unlike Caffè Americano.[121] Milk is added in various forms to an espresso: steamed milk makes a caffè latte,[122] equal parts steamed milk and milk froth make a cappuccino,[121] and a dollop of hot foamed milk on top creates a caffè macchiato.[123] A flat white is prepared by adding steamed hot milk (microfoam) to two espresso shots.[124] It has less milk than a latte, but both are varieties of coffee to which the milk can be added in such a way as to create a decorative surface pattern. Such effects are known as latte art.[125]\n\n\nCoffee is frequently served iced. Popular options include Frappés, Iced lattes, or stronger brewed coffee served with ice.[126]\n\n\nCoffee can also be incorporated with alcohol to produce a variety of beverages: it is combined with whiskey in Irish coffee, and it forms the base of alcoholic coffee liqueurs such as Kahlúa and Tia Maria. Some craft beers have coffee or coffee extracts added to the beer,[127] although porter and stout beers may have a coffee-like taste solely due to roasted grains.[128]\n\n\nMany products are sold for the convenience of consumers who do not want to prepare their coffee or who do not have access to coffeemaking equipment. Instant coffee is dried into soluble powder or freeze-dried into granules that can be quickly dissolved in hot water.[129] A New Zealand invention and staple, instant coffee was originally invented in Invercargill 1890, by food chemist David Strang.[130] It rapidly gained in popularity in many countries in the post-war period, with Nescafé being the most popular product.[131] Many consumers determined that the convenience of preparing a cup of instant coffee more than made up for a perceived inferior taste,[132] although, since the late 1970s, instant coffee has been produced differently in such a way that is similar to the taste of freshly brewed coffee.[133] Paralleling (and complementing) the rapid rise of instant coffee was the coffee vending machine invented in 1947 and widely distributed since the 1950s.[134]\n\n\nCanned coffee has been popular in Asian countries for many years, particularly in China, Japan, South Korea, and Taiwan. Vending machines typically sell varieties of flavored canned coffee, much like brewed or percolated coffee, available both hot and cold. Japanese convenience stores and groceries also have a wide availability of bottled coffee drinks, which are typically lightly sweetened and pre-blended with milk. Bottled coffee drinks are also consumed in the United States.[135][better source needed]\n\n\nLiquid coffee concentrates are sometimes used in large institutional situations where coffee needs to be produced for thousands of people at the same time. It is described as having a flavor about as good as low-grade robusta coffee and costs about 10¢ a cup to produce. The machines can process up to 500 cups an hour, or 1,000 if the water is preheated.[136][failed verification]\n\n\nOver 90 percent of coffee production takes place in developing countries—mainly South America—while consumption happens primarily in industrialized economies. There are 25 million small producers who rely on coffee for a living worldwide. In Brazil, where almost a third of the world's coffee is produced, over five million people are employed in the cultivation and harvesting of over three billion coffee plants; it is a more labor-intensive culture than alternative cultures of the same regions, such as sugar cane or cattle, as its cultivation is not automated, requiring frequent human attention.\n\n\nIn 2021, world production of green coffee beans was 9.9 million tonnes, led by Brazil with 30% of the total (table). Vietnam, Indonesia, and Colombia were other major producers.\n\n\nNearly 90 countries export coffee cherries, 60 of them developing countries, with coffee constituting the main export revenue for countries such as Burundi, Ethiopia, Rwanda, and formerly Haiti.[138] The largest producer by far is Brazil (almost 30% of world production in 2015), followed by Vietnam, Colombia, Indonesia, and Ethiopia.[139]\n\n\nCoffee production provides a living for about twenty-five million people, mainly small-scale producers, while imports, processing, and distribution provide a living for about one hundred to one hundred and ten million people.[140]\n\n\nCoffee is bought and sold as green coffee beans by roasters, investors, and price speculators as a tradable commodity in commodity markets and exchange-traded funds. Coffee futures contracts for Grade 3 washed arabicas are traded on the New York Mercantile Exchange under ticker symbol KC, with contract deliveries occurring every year in March, May, July, September, and December.[141][142][143][144] Higher and lower grade arabica coffees are sold through other channels. Futures contracts for robusta coffee are traded on the London International Financial Futures and Options Exchange and, since 2007, on the New York Intercontinental Exchange.[145]\n\n\nDating to the 1970s, coffee has been incorrectly described by many, including historian Mark Pendergrast, as the world's \"second most legally traded commodity\".[146][147] Instead, \"coffee was the second most valuable commodity exported by developing countries,\" from 1970 to circa 2000.[148] This fact was derived from the United Nations Conference on Trade and Development Commodity Yearbooks which show \"Third World\" commodity exports by value in the period 1970–1998 with crude oil in first place, coffee in second, followed by sugar, cotton, and others. Coffee continues to be an important commodity export for developing countries, but more recent figures are not readily available due to the shifting and politicized nature of the category \"developing country\".[146]\n\n\nInternational Coffee Day, which is claimed to have originated in Japan in 1983 with an event organized by the All Japan Coffee Association, takes place on 29 September in several countries.[149] There are numerous trade associations and lobbying and other organizations representing the coffee industry.[150][151]\n\n\nNordic countries are the highest coffee-consuming nations when measured per capita per year, with consumption in Finland as the world's highest.[152]\n\n\nAn April 2024, National Coffee Association survey indicated that coffee consumption in the U.S. reached a 20-year high, with 67% of U.S. adults reporting drinking coffee in the past day. This is a significant increase compared to 2004 when fewer than half of U.S. adults reported coffee consumption in the past day. Drip coffee remains the most popular brewing method, but espresso-based beverages, particularly lattes, espresso shots, and cappuccinos, gained popularity.[153]\n\n\nMarket volatility, and thus increased returns, during 1830 encouraged Brazilian entrepreneurs to shift their attention from gold to coffee, a crop hitherto reserved for local consumption. Concurrent with this shift was the commissioning of vital infrastructures, including approximately 7,000 km (4,300 mi) of railroads between 1860 and 1885. The creation of these railways enabled the importation of workers, to meet the enormous need for labor. This development primarily affected the State of Rio de Janeiro, as well as the Southern States of Brazil, most notably São Paulo, due to its favorable climate, soils, and terrain.[154]\n\n\nCoffee production attracted immigrants in search of better economic opportunities in the early 1900s. Mainly, these were Portuguese, Italian, Spanish, German, and Japanese nationals. For instance, São Paulo received approximately 733,000 immigrants in the decade preceding 1900, whilst only receiving approximately 201,000 immigrants in the six years to 1890. The production yield of coffee increases. In 1880, São Paulo produced 1.2 million bags (25% of total production), in 1888 2.6 million (40%), and in 1902 8 million bags (60%).[155] Coffee is then 63% of the country's exports. The gains made by this trade allow sustained economic growth in the country.\n\n\nThe four years between planting a coffee and the first harvest extend seasonal variations in the price of coffee. The Brazilian Government is thus forced, to some extent, to keep strong price subsidies during production periods.\n\n\nThe concept of fair trade labeling, which guarantees coffee growers a negotiated preharvest price, began in the late 1980s with the Max Havelaar Foundation's labeling program in the Netherlands. In 2004, 24,222 metric tons (of 7,050,000 produced worldwide) were fair trade; in 2005, 33,991 metric tons out of 6,685,000 were fair trade, an increase from 0.34% to 0.51%.[156][157] A number of fair trade impact studies have shown that fair trade coffee produces a mixed impact on the communities that grow it. Many studies are skeptical about fair trade, reporting that it often worsens the bargaining power of those who are not part of it. The first fair-trade coffee was an effort to import Guatemalan coffee into Europe as \"Indio Solidarity Coffee\".[158]\n\n\nSince the founding of organizations such as the European Fair Trade Association (1987), the production and consumption of fair trade coffee has grown as some local and national coffee chains started to offer fair trade alternatives.[159] For example, in April 2000, after a year-long campaign by the human rights organization Global Exchange, Starbucks decided to carry fair-trade coffee in its stores.[160] Since September 2009 all Starbucks Espresso beverages in UK and Ireland are made with Fairtrade and Shared Planet certified coffee.[161]\n\n\nA 2005 study done in Belgium concluded that consumers' buying behavior is not consistent with their positive attitude toward ethical products. On average 46% of European consumers claimed to be willing to pay substantially more for ethical products, including fair-trade products such as coffee. The study found that the majority of respondents were unwilling to pay the actual price premium of 27% for fair trade coffee.[160]\n\n\nSpecialty coffee has driven a desire for more traceable coffee, and as such businesses are offering coffees that may come from a single origin, or a single lot from a single farm. This can give rise to the roaster developing a relationship with the producer, to discuss and collaborate on coffee. The roaster may also choose to cut out the importers and exporters to directly trade with the producer, or they may \"fairly trade\", where any third-parties involved in the transaction are thought to have added value, and there is a high level of transparency around the price, although often there is no certification to back it up.[162] This process tends to only be done for high-quality products since keeping the coffee separate from other coffees adds costs, and so only coffee that roasters believe can command a higher price will be kept separate.[163]\n\n\nSome coffee is sold through internet auction – much of it is sold through a competition, with coffees passing through local and international jurors, and then the best coffees being selected to be bid on. Some estates known for high-quality coffee also sell their coffee through an online auction. This can lead to increased price transparency since the final price paid is usually published.[162]\n\n\n\n\n\nBrewed coffee from typical grounds has no essential nutrients in significant content.[164] In espresso, however, likely due to its higher amount of suspended solids, there are significant contents of magnesium, the B vitamins, niacin and riboflavin, and 212 mg of caffeine per 100 grams of grounds.[165]\n\n\nOne psychoactive chemical in coffee is caffeine, an adenosine receptor antagonist that is known for its stimulant effects.[166] Coffee also contains the monoamine oxidase inhibitors β-carboline and harmane, which may contribute to its psychoactivity.[167] In a healthy liver, caffeine is mostly broken down by hepatic enzymes. The excreted metabolites are mostly paraxanthines—theobromine and theophylline—and a small amount of unchanged caffeine. Therefore, the metabolism of caffeine depends on the state of this enzymatic system of the liver.[168]\n\n\nCoffee is also known for its laxative effects, inducing defecation in some people within minutes of consumption.[169][170][171][172][173] However, the specific mechanism of action and chemical constituents responsible are still unknown, but some studies have suggested caffeine is likely not responsible.[174][175]\n\n\nPolyphenols in coffee have been shown to affect free radicals in vitro,[176] but there is no evidence that this effect occurs in humans. Polyphenol levels vary depending on how beans are roasted as well as for how long. As interpreted by the Linus Pauling Institute and the European Food Safety Authority, dietary polyphenols, such as those ingested by consuming coffee, have little or no direct antioxidant value following ingestion.[177][178][179]\n\n\nA 2017 review of clinical trials found that drinking coffee is generally safe within usual levels of intake and is more likely to improve health outcomes than to cause harm at doses of 3 or 4 cups of coffee daily. Exceptions include possible increased risk in women having bone fractures, and a possible increased risk in pregnant women of fetal loss or decreased birth weight. Results were complicated by poor study quality, and differences in age, gender, health status, and serving size.[180]\n\n\nDepending on the type of coffee and method of preparation, the caffeine content of a single serving can vary greatly.[181][182][183] The caffeine content of a cup of coffee varies depending mainly on the brewing method, and also on the coffee variety.[184] According to the USDA National Nutrient Database, a 240-millilitre (8 US fl oz) cup of \"coffee brewed from grounds\" contains 95 mg caffeine, whereas an espresso (25 mL) contains 53 mg.[185] According to an article in the Journal of the American Dietetic Association, coffee has the following caffeine content, depending on how it is prepared:[182]\n\n\nCaffeine remains stable up to 200 °C (392 °F) and completely decomposes around 285 °C (545 °F).[186] Given that roasting temperatures do not exceed 200 °C (392 °F) for long and rarely if ever reach 285 °C (545 °F), the caffeine content of a coffee is not likely changed much by the roasting process.[187]\n\n\nCoffee is often consumed alongside (or instead of) breakfast by many at home or when eating out at diners or cafeterias. It is often served at the end of a formal meal, normally with a dessert, and at times with an after-dinner mint, especially when consumed at a restaurant or dinner party.[188]\n\n\nWidely known as coffeehouses or cafés, establishments serving prepared coffee or other hot beverages have existed for over five hundred years. The first coffeehouse in Constantinople was opened in 1475 by traders arriving from Damascus and Aleppo.[190]\n\n\nA contemporary term for a person who makes coffee beverages, often a coffeehouse employee, is a barista. The Specialty Coffee Association of Europe and the Specialty Coffee Association of America have been influential in setting standards and providing training.[191]\n\n\nA coffee break in the United States and elsewhere is a short mid-morning rest period granted to employees in business and industry, corresponding with the Commonwealth terms \"elevenses\", \"smoko\" (in Australia), \"morning tea\", \"tea break\", or even just \"tea\". An afternoon coffee break, or afternoon tea, often occurs as well.\n\n\nThe coffee break originated in the late 19th century in Stoughton, Wisconsin, with the wives of Norwegian immigrants. The city celebrates this every year with the Stoughton Coffee Break Festival.[192] In 1951, Time noted that \"[s]ince the war, the coffee break has been written into union contracts\".[193] The term subsequently became popular through a Pan-American Coffee Bureau ad campaign of 1952 which urged consumers, \"Give yourself a Coffee-Break – and Get What Coffee Gives to You.\"[194] John B. Watson, a behavioral psychologist who worked with Maxwell House later in his career, helped to popularize coffee breaks within the American culture.[195]\n\n\nHistorically, several religious groups have prohibited or condemned the consumption of coffee. The permissibility of coffee was debated in the Islamic world during the early 16th century, variously being permitted or prohibited until it was ultimately accepted by the 1550s.[196] Contention existed among Ashkenazi Jews as to whether coffee was acceptable for Passover until it was certified kosher in 1923.[197] Some Christian groups, such as Mormons and Seventh-day Adventists, discourage the consumption of coffee.[198][199]\n\n\nFurthermore, coffee has been prohibited for political and economic reasons. King Charles II of England briefly outlawed coffeehouses to quell perceived rebellion.[29] King Frederick the Great banned it in Prussia, concerned about the price of importing of coffee without production colonies.[200][201] Sweden prohibited coffee in the 18th century for the same reasons.[202] Coffee has seldom been prohibited based on its intoxicating effect.[203]\n\n\nThere are many stories about coffee and its impact on people and society. The Oromo people would customarily plant a coffee tree on the graves of powerful sorcerers. They believed that the first coffee bush sprang up from the tears that the god of heaven shed over the corpse of a dead sorcerer.[204] Johann Sebastian Bach was inspired to compose the humorous Coffee Cantata, about dependence on the beverage, which was controversial in the early 18th century.[205]\n\n\nIn the United States, coffee is sometimes called a \"cup of Joe\". The origins of this phrase is in dispute; a common story is that in World War I the US Secretary of the Navy Josephus \"Joe\" Daniels banned alcohol on navy ships which meant that the strongest drink available aboard the ship was black coffee. Sailors began referring to coffee as a \"cup of Joe\" in reference to Daniels. However, this story may be apocryphal since the first written account of it was in 1930, some 15 years later. Another explanation is that a formerly popular nickname for coffee, \"jamoke\" from mocha java, was shortened to \"Joe\". A third origin story is that since coffee is such a commonly consumed beverage, it's the drink of the average Joe.[206][207][208]\n"
    },
    {
        "title": "Starbucks Coffee Company",
        "url": "https://www.starbucks.com/",
        "description": "Just because it's summer. Treat someone special to a moment of delight with a Starbucks eGift. ... *50% off handcrafted drink valid for 7 days from sign up, at ...",
        "text": "© 2024 Starbucks Coffee Company. All rights reserved."
    },
    {
        "title": "The Coffee Bean & Tea Leaf | CBTL",
        "url": "https://coffeebean.com/",
        "description": "Born and brewed in Southern California since 1963, The Coffee Bean & Tea Leaf® is passionate about connecting loyal customers with carefully handcrafted ...",
        "text": null
    },
    {
        "title": "Coffee",
        "url": "https://www.reddit.com/r/Coffee/",
        "description": "r/Coffee: /r/Coffee is back - for now - and talking about itself, in addition to coffee.",
        "text": "\n          Reddit and its partners use cookies and similar technologies to provide you with a better experience.\n        \n\n\n          By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising.\n        \n\n\n          By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform.\n        \n\n\n          For more information, please see our\n              Cookie Notice\n              and our\n              Privacy Policy.\n        \n\n\n    Welcome to the daily /r/Coffee question thread!\n  \n\n\n    There are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the /r/Coffee community loves to help out.\n  \n\n\n    Do you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n  \n\n\n    Don't forget to use the resources in our wiki! We have some great starter guides on our wiki \"Guides\" page and here is the wiki \"Gear By Price\" page if you'd like to see coffee gear that /r/Coffee members recommend.\n  \n\n\n    As always, be nice!\n  \n\n\n    This is a thread for the enthusiasts of r/Coffee to connect with the industry insiders who post in this sub!\n  \n\n\n    Do you want to know what it's like to work in the industry? How different companies source beans? About any other aspects of running or working for a coffee business? Well, ask your questions here! Think of this as an AUA directed at the back room of the coffee industry.\n  \n\n\n    This may be especially pertinent if you wonder what impact the COVID-19 pandemic may have on the industry (hint: not a good one). Remember to keep supporting your favorite coffee businesses if you can - check out the weekly deal thread and the coffee bean thread if you're looking for new places to purchase beans from.\n  \n\n\n    Industry folk, feel free to answer any questions that you feel pertain to you! However, please let others ask questions; do not comment just to post \"I am _______, AMA!” Also, please make sure you have your industry flair before posting here. If you do not yet have it, contact the mods.\n  \n\n\n    While you're encouraged to tie your business to whatever smart or charming things you say here, this isn't an advertising thread. Replies that place more effort toward promotion than answering the question will be removed.\n  \n\n\n    Please keep this thread limited to industry-focused questions. While it seems tempting to ask general coffee questions here to get extra special advice from \"the experts,\" that is not the purpose of this thread, and you won't necessarily get superior advice here. For more general coffee questions, e.g. brew methods, gear recommendations for home brewing, etc, please ask in the daily Question Thread.\n  \n\n\n    A standard phin produces ~4oz of coffee. When it’s served at coffee shops, you get upwards to 16oz without diluting the coffee. How do they get a higher quantity without diluting the brew, especially when they serve it on a mountain of ice?\n  \n\n\n    Techniques that I’ve heard of but haven’t tested:\n  \n\n\n    Simply doubling the batch. I’m skeptical about the economics of this from a coffee shop’s POV, but it could very well be the case?\n  \n\n\n    Extracting twice and with a stronger bean (100% robusta)\n  \n\n\n    Finer grounds for a slower drip, thus extracting more flavor\n  \n\n\n    Add more grounds with each extraction but less than if it were an entirely different batch\n  \n\n\n    Posts and comments to this community are expected to be on-topic to coffee beans or beverage, or to Specialty Coffee if industry-/community-focused.\n  \n\n\n    The less coffee-focused a post, the more notable we expect the subject to be. A post about a well-known coffee company's business may be deemed \"on topic\" as it is news that the community would want to discuss, while a post very on-topic to the coffee of an obscure company may be removed as too niche.\n  \n\n\n    Mod judgement is used for final decisions.\n  \n\n\n    This is not a community for meme, 'pretty,' or neat, pictures or videos; r/cafe is our light-content sister sub; content here is expected to be educational or informative, where the image/video is necessary to that. Image or video posts must be accompanied by a substantial comment from OP providing content and any necessary context.\n  \n\n\n    Questions needing images should be posted as self with the image linked in the text, so that the question is the first thing readers open rather than the picture.\n  \n\n\n    Posts or questions that are lacking substance or specifics may be removed, at mod discretion - the community has expressed frustrations with 'boring' or repetitive content here.  Examples are posts like \"i had coffee it was good\", questions like \"has anyone tried X\", \"X, thoughts?\", \"what gear should I buy?\" or \"I just bought X, tips?\", cases where OP should ask customer service, or readily-googled info.\n  \n\n\n    Many of these may be posted to weekly threads, instead, like Noob Questions or Hardware.\n  \n\n\n    We're aiming to be civil here, please endeavour to live up to that - be reasonable, stay on topic, and don't escalate.\n  \n\n\n    Sometimes dialogue gets spicy here - it's on both parties to set a tone that they're comfortable with. If someone insults you, what you say in response is your responsibility & we'd ask that you not escalate. That said, \"Be Civil\" or \"don't escalate\" are very deliberately not protection from getting feedback for being low-key rude.\n  \n\n\n    Coffee needs to walk a fine line here; our line is \"education\" - is the content presented without personal judgement and with teaching that is useful.\n  \n\n\n    We have a very low tolerance for perspectives that want to gatekeep coffee or engage in elitist circlejerking, even including when phrased as jokes or satire; however there are also common misconceptions about coffee that can be perceived as elitist when clarified - ie \"moka doesn't make espresso\" - that we would be wrong to ban.\n  \n\n\n    We are very hard on self-promotion & promotion here.  Do not promote businesses, projects, or causes that you have ties to, (owner, investor, employee, family, good friend, etc.) under any circumstances.  Not if 'they asked', not if its extra-relevant, not if you don't profit, not if you only DM, not if _____.\n  \n\n\n    We have a wiki page that covers these rules in detail, if needed.\n  \n\n\n    Because we have strong rules about self-promotion here, sometimes marketers opt to lie and pretend they're not \"self\" promoting - \"I'm just a normal person, totally not affiliated at all!\" - and as much as this community dislikes marketing, it really dislikes being lied to.\n  \n\n\n    Lies by omission, like \"i found a thing,\" count just as much as lies by addition, and none are welcome here.  Be honest about your entanglements while visiting us, please.\n  \n\n\n    Affiliate and referrals are not welcome here, to the point where sites or content containing affilites are also barred, even if the person posting is not 'tied' to the site in question.  This rule applies to any and all systems where the person or site sharing the link/code 'gains' something or somehow from other people using it.\n  \n\n\n    Just ... they're too much of a problem, with too much dishonesty, for us to draw fine-line distinctions without either being unfair or incentivizing dishonesty.\n  \n\n\n    Product reviews go in Battlestation threads, please; and nothing about unreleased or recently-released products - readers here want honest and trustworthy reviews and those cannot be had on products that \"real people\" have not yet had a chance to try.\n  \n\n\n    Because new/unreleased products so commonly shill social media about them, those discussions here are heavily targeted and not to be trusted; because our readers expect us to maintain trust, we bar those products until reviews can be trusted.\n  \n\n\n    Absolutely no crowdfunding projects; whether they're in pre-release, active funding, post-funding, ... whatever. We are not a stop on the crowdfund PR tour, and will not be. Once a crowdfunding project stops being 'a project' and starts being a normal retail product that people own, we'll relax our rules on them - mods will make the determination when this is the case.\n  \n\n\n    This rule is complimentary to #9 \"pre-release\", but crowdfunding gets a special mention because of how big a problem it's been.\n  \n\n\n    We know that we're a big targeted audience of coffee-drinkers and consumers, so we seem like a great place to put surveys or market research about coffee use, hardware, or software - but because there's so many school projects, apps, and businesses, in total, we have been asked by the community to bar all instances of them.\n  \n\n\n    No surveys, no polls, no market research, no \"what should I make\" or \"what should an app include\" ... please just build your thing or write your report without us.\n  \n\n\n    Coffee-related 'health-science' articles & users seeking health advice are not appropriate in this coffee enthusiast community. We are not medical professionals - we are hobbyists and pros. If you have physical or mental symptoms associated with coffee consumption, or are wanting coffee-specific health advice - you need to speak to a physician about your concerns.\n  \n\n\n    This community has, in the past, given terrible or even dangerous medical advice - this rule exists to prevent that reoccurring.\n  \n\n\n    We're a complicated community and cannot have perfect rules.  Mods reserve the right to remove content and issue bans, as needed, for the health of our community, and cannot guarantee that every possible edge-case will merit it's own place in these rules.\n  \n\nWe're equal parts a passionate horde of amiable amateurs and the back room lounge of the coffee industry. To us, the world of coffee is more complex than just a tasty caffeinated beverage to get you going. This is a place to talk about the farms, the beans, the baristas, the roasters, the industry, the brewing gear & techniques. It's a place to ask questions about how to make your daily cup just a little bit better. Its a place to learn, share, and make new friends. Welcome to /r/coffee!\n\nOur Manifesto\n\nFurther Explanation of our General Rules\n\nOur Self-Promotion Rules\n\nThese lay out our our expectations for participants, but also the values and rationales behind them. In short, be nice, respect this community and its members, don't try to sell or promote stuff, and be aware comments and submissions are both curated content within this space.\n\nWe run weekly special threads, listed below. Detailed descriptions.\n\nVisit our wiki page!"
    },
    {
        "title": "Peet's Coffee | The Original Craft Coffee, Est. 1966",
        "url": "https://www.peets.com/",
        "description": "A rich blend of layered origins, threading the warmth of the season through classic interplays of brown sugar & black currant with notes of warm spice and a ...",
        "text": "\n    July's Limited Release\n  \n\n\n    The Best Gift Ever\n  \n\n\n    July's Limited Release\n  \n\n\n    The Best Gift Ever\n  \n\n\n    Curated for the Curious\n  \n\n\n    Breakfast Blend\n  \n\n\n    Curated for the Curious\n  \n\n\n    Breakfast Blend\n  \n\n\n    Find Your Coffee Match\n  \n\n\n    Shop Mighty Leaf Tea\n  \n\n\n    Find Your Coffee Match\n  \n\n\n    Shop Mighty Leaf Tea\n  \n\n\n    Download the App\n  \n\n\n    Find a Coffeebar\n  \n\n\n    Download the App\n  \n\n\n    Find a Coffeebar\n  \n\n\n    Order from a Coffeebar\n  \n\n\n    Curated for the Curious\n  \n\n\n              When you’re craving cold brew, you’re thirsting for a smooth cup with low acidity and a clean finish. Cold brewing doesn’t extract an extreme range of flavors, so it’s smoother and sweeter. Need a refresher? Let us help.\n            \n\n\n              When you’re craving cold brew, you’re thirsting for a smooth cup with low acidity and a clean finish. Cold brewing doesn’t extract an extreme range of flavors, so it’s smoother and sweeter. Need a refresher? Let us help.\n            \n\nThe zingiest, zippiest, coolest beverages are here. Try our refreshing Sparkling Grapefruit Cold Brew, Sparkling Passion Fruit Iced Tea, and Sparkling Lemonade at a coffeebar near you.\n\nNewsweek named Peetnik Rewards as one of America's Best Loyalty Programs. Join today to find out why.\n\nThese delicate beans are grown in Brazil’s first Designation of Origin, renowned for high-quality coffee. Savor the sweet, creamy notes of macadamia nut and almond butter—delicious hot or iced.\n\nWe set out to craft the perfect Breakfast Blend: bright, optimistic, warm, and welcoming of the new day. And here it is: a welcome companion to your morning ritual.\n\nZenith shines with Rwanda’s juicy cherry cola notes, sweet caramel from Guatemala, and smooth body from Papua New Guinea. This limited release is perfect hot, iced, or as cold brew.\n\nThe same commitment, same care, and same coffee—all in recyclable packaging.\n\nHand roasted on demand and delivered fresh to your door.\n\nSavor Mighty Leaf’s tea collection: Different from the start.\n\nThe coffees our customers love best. From dark to light, intense to bright, there's always a new cup worth experiencing.\n\nRefine your palate and elevate your coffee experience with this premier blend, our all-time best seller.\n\nFor those who relish smoky overtones and a pleasant bite, drinking French Roast exemplifies our commitment to rich, powerful coffee.\n\nSteeped in myth and origin, you can taste the full-bodied nature of the best mocha beans from East and West in this world-famous blend.\n\nWhen our coffee team encounters extraordinary coffees, they set aside just enough to share with others who might relish an incredible cup. Every month experience a different limited release, rare microlot from smallholder farms in the world’s best coffee-growing regions.\n\n\nSubscribe to the Small Batch Series today to get access to Peet's limited time offering for June, Panama Don Bosco.\n\nUniquely crafted for you, the espresso lover looking for stout body, rich flavor, and perfect crema. An espresso that lives up to its name.\n\nFor those seeking a penetrating, balanced roast with vigorous flavors. Masterfully slow roasted for boldly perfect cups.\n\nQuite possibly the most flavorful cup of decaf you’ll ever taste. Our most popular blend, without caffeine.\n\nA rich blend of layered origins, threading the warmth of the season through classic interplays of brown sugar & black currant with notes of warm spice and a lingering finish.\n\n\nLast order date: January 5\n\nWater-process decaffeination means you’ll taste only the rich, ancient blend of Java and Ethiopian Mocca coffees, not caffeine.\n\nConcentrated body and distinctly nuanced aroma transport the senses in this rich and complex “spice box of flavors.”\n\nYou know when something is a favorite, there’s a reason. Let this Latin American blend be your perfect introduction to Peet’s coffees.\n\nFeel the connection to the canopied mountains where this sustainable, Bird Friendly certified Colombian coffee is grown. Complex and satisfying with milk chocolate sweetness.\n\nLooking for some slow sipping and savoring? This medium roast blend was crafted from three Latin American coffees, for moments just like these.\n\nTaste heaven in your cup. A rare coffee, semi-aged and cultivated in the traditional Sulawesi method.\n\nCelebrate the diverse flavors of the islands with this satisfying blend of tropical single-origin Indo-Pacific coffees.\n\nSavor a coffee both potent and refined from the best farm in Antigua, a favorite of our Roastmasters for more than 40 years.\n\nOur most loved medium roast—smooth with a balanced richness.\n\nFor those who enjoy the bold taste and smoky overtones of French Roast but prefer to do without the caffeine.\n\nFor those who embrace a bit of wildness, a full-bodied desert miracle from Yemen’s harsh, dry mountain terrain.\n\nA sensory, seductive cup, brimming with complexity and herbal nuance. Rustically hand-processed for those seeking classic Indonesian heft.\n\nTo brew French Roast is a commitment to the enjoyment of rich, powerful taste, pronounced smoky overtones, and pleasant bite.\n\nWith the same richness and character as our regular Sumatra, it’s hard to imagine this is a decaf coffee. \n\nMany say Kenyan coffee is the best there is; we don't think there's any better than our Auction Lot— juicy, complex, sweet, and dazzling.\n\nExperience the elegance of Ethiopia, the birthplace of coffee, with this aromatic coffee, meticulously prepared by the washed method.\n\nFor those seeking exceptional, full-bodied Colombian coffee, shining and sweet from the rarest lots.\n\nOur single origin coffees are the quintessential expressions of a coffee’s terroir. Explore the unique, nuanced flavors of the world’s best coffee regions month by month, getting to know the elemental flavors and aromatics specific to each region.\n\nRefine your palate and elevate your coffee experience with this premier blend, our all-time best seller.\n\n\n*Sold in increments of 3 boxes.\n\nRistretto (intensity 10, dark roast) evokes a classic “short pull” espresso, with notes of crushed spiced and rich chocolate. Compatible with Nespresso Original machines.*\n\n\n*Sold in increments of 5 boxes.\n\nWildly fragrant and famous for its unequalled natural flavor: a distinctive blast of dried blueberries shot through with notes of white flower, finishing with candied citron sweetness.\n\n\nLast day to order: February 28\n\nBlack as night, sweet as a brûlée topping. Nerissimo (intensity 11) is our darkest espresso roast in a convenient aluminum capsule that is compatible with your Nespresso Original machine.*\n\n\n*Sold in increments of 5 boxes.\n\nCrema Scura (intensity 9, medium roast) offers a dark luscious crema and earthy, nutty notes in a convenient aluminum capsule that is compatible with your Nespresso Original machine.*\n\n\n*Sold in increments of 5 boxes.\n\nFor those who relish smoky overtones and a pleasant bite, drinking French Roast exemplifies our commitment to rich, powerful coffee.\n\n\n*Sold in increments of 3 boxes.\n\nDecaffeinato Ristretto (intensity 9, dark roast) is fragrant and nutty with a luxurious finish. It's rich, bold decaf espresso in a convenient aluminum capsule that's compatible with your Nespresso Original machine.*\n\n\n*Sold in increments of 5 boxes.\n\nA rich blend of layered origins, threading the warmth of the season through classic interplays of brown sugar & black currant with notes of warm spice and a lingering finish.\n\n\nLast order date: January 5\n\n\n*Note: The bag will be labeled \"Decaf\" on the right-hand side panel.\n\nLet this customer-favorite Latin American blend be your perfect introduction to Peet’s coffees, without the caffeine. Rich and balanced.\n\n\n*Sold in increments of 3 boxes.\n\nThese coffees get more than just reviews—they get fan letters. Experience our most anticipated, limited release coffees of each season without having to mark your calendar. Enjoy our Holiday Blend, Anniversary Blend, Ethiopian Super Natural and more!\n\nA rich blend of layered origins, threading the warmth of the season through classic interplays of brown sugar & black currant with notes of warm spice and a lingering finish.\n\n\n*Sold in increments of 3 boxes.\n\nTake a deeper dive into dark roast. Each month subscribers experience a curated selection of classics like Ethiopian Fancy, Sumatra, Major Dickason’s Blend, and French Roast. \n\nTalk about easy-drinking. Experience one of our most-loved medium roasts every month, including flavorful favorites like Big Bang®, Café Domingo®, and Organic Alameda Morning Blend. \n\nSweet espresso melds beautifully with rich caramel and the creaminess of steamed milk. Available in a convenient capsule that is compatible with your Nespresso Original machine.* \n\n\n*Sold in increments of 5 boxes.\n\nPeet’s makes it easy to get coffee people exactly what they want with a Gift Subscription. You choose the duration, they choose the coffee, everyone wins. Best gift ever.\n\nNote: ﻿One 16oz bag of coffee ships for $21.95 per month.\n\nIt’s true, we do decaf better, including flavorful favorites like Decaf Big Bang®, Decaf House Blend, Decaf Major Dickason’s Blend, and Decaf Sumatra.\n\nFor the ultimate in convenience, Peet’s K-Cup® Pods Subscription Series delivers a curated selection of delightful new flavors every month.\n\n\n*Sold in increments of 3 boxes\n\nExplore 4 of our dark, rich espresso blends with this variety pack featuring Nerissimo, Ristretto, Crema Scura, & Ricchezza (10ct carton of each). Compatible with your Nespresso Original machine.*\n\nExplore the world of Peet's K-Cup Pods with this variety pack featuring eight 10ct boxes in our bestselling K-Cup flavors.\n\nStart a new subscription and get 30% off your first order\n\nWe cover the cost, so you can enjoy every cup\n\nOur Curated Series subscriptions feature a different coffee each month\n\n\n            Elevate your lunch this summer with the all-new Roasted Turkey Parmesan Ciabatta and Sparkling beverages.\n          \n\n\n            Sign up for our newsletter and receive 10% off + free shipping on your first order.\n          \n\n\n          Peet’s Coffee Berkeley, California\n        \n\nEst. 1966\n\n\n            *Nespresso is a registered trademark of Société des Produits Nestlé S.A., and is not affiliated with Peet’s Coffee Inc. Compatible with most Nespresso Original machines.\n          \n\n\n        You are only $49.00 away from free shipping!\n      \n\n\n        You are only $49.00 away from free shipping!\n      \n\nShop Coffee\n\nShop Tea\n\nShop Equipment\n\nShop Subscriptions\n\n\n\n                \n                  Subtotal\n                \n              \n$0\n\n\nEstimated ship date based on items in your cart. Ship dates subject to change. Visit our FAQ page to learn more.\n\nPeet's Cards can be purchased only as a single-item transaction. After completing this order, begin a new transaction to purchase a Peet's Card.\n\nPeet's Cards can be purchased only as a single-item transaction. After completing this order, begin a new transaction to purchase other desired items.\n\n“The Earth is what we all have in common.”\n\nWendell Berry"
    },
    {
        "title": "Coffee health benefits: Diabetes, heart health, liver cancer, and more",
        "url": "https://www.medicalnewstoday.com/articles/270202",
        "description": "Coffee and heart health. The 2017 meta-analysisTrusted Source found that caffeine consumption may have at least a small benefit for cardiovascular health, ...",
        "text": "In some cases, coffee may be good for health, as it may offer benefits such as lowering the risk of type 2 diabetes and helping people lose weight.\n\nWorldwide, experts estimate that people consume around 2.25 billion cups of coffee per day. Researchers have looked at the benefits of drinking coffee for conditions such as diabetes, cardiovascular disease, inflammatory bowel disease, and liver disease. There is evidence to support some, but not all, of these claims.\n\nCoffee contains a number of useful nutrients, including riboflavin (vitamin B2), niacin (vitamin B3), magnesium, potassium, and various phenolic compounds, or antioxidants. Some experts suggest that these and other ingredients in coffee can benefit the human body in various ways.\n\nThis article looks at the possible health benefits of drinking coffee, the evidence supporting those benefits, and the risks of drinking coffee.\n\nSome potential health benefits associated with drinking coffee include protection against type 2 diabetes, Parkinson’s disease, liver disease, and liver cancer. Coffee consumption may also support cardiovascular health.\n\nThe sections below cover these benefits in more detail.\n\nCoffee may help protect against type 2 diabetes.\n\nIn 2014, researchers who gathered data on over 48,000 people found that those who increased their coffee consumption by at least one cup per day over 4 years had an 11% lower risk of type 2 diabetes than those who did not increase their intake.\n\nA 2017 meta-analysis concluded that people who drank four to six cups of either caffeinated or decaffeinated coffee each day appeared to have a lower risk of metabolic syndrome, including type 2 diabetes.\n\nVarious studies have suggested that caffeine, which is present in coffee and many other beverages, may help protect against Parkinson’s disease.\n\nOne team concluded that men who drink over four cups of coffee per day might have a fivefold lower risk of Parkinson’s disease than those who do not.\n\nThe findings of the 2017 meta-analysis suggested a link between coffee consumption and a lower risk of Parkinson’s disease, even among people who smoke. This team also found that people who drink coffee may be less likely to experience depression and cognitive conditions such as Alzheimer’s disease.\n\nHowever, there was not enough evidence to prove that drinking decaffeinated coffee helps prevent Parkinson’s disease.\n\nIn 2019, a literature review concluded that coffee intake is likely to reduce the risk of liver cancer. \n\nEarlier, in 2015, a cohort study of a multiethnic population in the United States suggested that depending on the dose, consuming two to three cups of coffee daily reduced the participants’ risk of developing hepatocellular carcinoma and chronic liver disease (CLD) by 38% and 46%, respectively. \n\nThe meta-analysis from 2017 also concluded that consuming any type of coffee appears to reduce the risk of liver cancer, nonalcoholic fatty liver disease, and cirrhosis. These findings are now bolstered by a 2021 study suggesting that consuming all types of coffee may offer some protection against CLD.\n\nLearn more about the 2021 study on coffee and liver disease here.\n\nPeople who consume coffee may also have a lower risk of gallstone disease.\n\nIn 2014, researchers looked at coffee consumption among people with primary sclerosing cholangitis (PSC) and primary biliary cirrhosis (PBC). These are autoimmune conditions that affect the bile ducts in the liver.\n\nThey found that people with PSC were more likely to have a lower coffee intake than those without the condition. There was no evidence to suggest that coffee intake was different among people with or without PBC.\n\nAlso, another 2014 study suggested a link between coffee consumption and a lower risk of dying from nonviral hepatitis-related cirrhosis. The researchers suggested that drinking two or more cups of coffee every day might reduce the risk by 66%.\n\nThe 2017 meta-analysis found that caffeine consumption may have at least a small benefit for cardiovascular health, including blood pressure.\n\nIn a 2018 study, researchers found that drinking three to five cups of coffee per day may reduce the risk of cardiovascular disease by 15%. Drinking one to five cups daily also seemed to be associated with lower overall mortality resulting from any cause.\n\nFor those people who have already experienced a heart attack, drinking coffee does not appear to increase their risk of experiencing another or dying as a result.\n\nThe 2017 meta-analysis, however, also found that there may be higher levels of blood lipids (fat) and cholesterol in people who consume more coffee. These substances may predispose a person to heart problems.\n\nDoes decaffeinated coffee have benefits or risks? Learn more here.\n\nThere is some evidence suggesting that consuming coffee may help people lose weight. One 2018 paper indicated that the more coffee the participants drank, the higher their mean reduction in weight, body mass index (BMI), and fat mass.\n\nA 2019 study suggested that drinking coffee may have a modest association with weight loss, with a greater association in men than in women. However, these results have not been replicated, so they may not be definitive. \n\nAlthough coffee may provide some benefits in reducing obesity, it is not a substitute for eating a balanced diet and exercising often.\n\nOne hundred milliliters (about 3.3 ounces [oz]) of regular black coffee (without milk or cream) is low in calories. That is about one typical cup of black coffee, and it only contains around 2 calories. However, adding cream or sugar will increase the calorific value.\n\nCoffee beans also contain polyphenols, which are a type of antioxidant. Antioxidants can help protect the body against free radical damage. Free radicals are a type of waste product that the body naturally produces as a result of certain processes. \n\nFree radicals act as toxins in the body and may cause inflammation. Scientists have found links between inflammation and various aspects of metabolic syndrome, including type 2 diabetes and obesity.\n\nIn 2018, some researchers suggested that the antioxidant content of coffee may offer protection from metabolic syndrome.\n\nAlthough scientists can prove that certain compounds are present in coffee beans, it remains unclear what happens to them once they enter the human body.\n\nDrinking a lot of coffee can also have some adverse effects. These may include the following.\n\nSome studies have suggested that women who drink a lot of coffee may have a higher risk of bone fractures.\n\nMen with a higher coffee intake, on the other hand, appear to have a slightly lower risk.\n\nCoffee consumption may also not be safe during pregnancy. In fact, there is some evidence to suggest a link between high coffee consumption and pregnancy loss, low birth weight, and preterm birth.\n\nThere may be a higher risk of endometriosis among women who drink coffee, but there is not enough evidence to confirm such a link.\n\nPeople who drink a lot of coffee may have a slightly higher risk of this condition.\n\nConsuming high amounts of caffeine may increase the risk of anxiety, especially among people with panic disorder or social anxiety disorder. Less commonly, caffeine may trigger mania and psychosis in those who are susceptible.\n\nOne study from 2016 concluded that a high intake of caffeine during adolescence could lead to permanent changes in the brain.\n\nThe scientists behind the study expressed concern that this could increase the risk of anxiety-related conditions in adulthood.\n\nIn 2015, a group of researchers found relatively high levels of mycotoxins in commercial coffee. Mycotoxins are toxic substances that can contaminate coffee as a natural product.\n\nSome people worry that acrylamide, which is another chemical present in coffee, may be dangerous. Find out more here.\n\nAlthough consuming caffeine may offer some benefits, there can be negative side effects if a person drinks too much of it. These side effects may include:\n\nBoth coffee and tea contain caffeine, so they may have some of the same benefits, risks, and side effects. \n\nHowever, although the amount of caffeine in each beverage can depend on the type of coffee or tea, generally, one 8-oz cup of coffee contains about 95 mg of caffeine. Similar-sized cups of black and green tea contain only 48 mg and 29 mg of caffeine, respectively.\n\nThere may be some differences in the way that drinking tea and coffee may impact different people, depending on which beverage they prefer and how much of it they consume.\n\nAccording to a 2018 study that compared the positive effects of coffee and tea consumption, the differences in benefits are as follows:\n\nThe overall conclusion of the study is that coffee and tea both have their own benefits depending on the quantity consumed, and these benefits may vary among men and women. The difference in impact based on sex may be related to how coffee affects sex hormones.\n\nThe meta-analysis from 2017 concluded that it is “generally safe” for most people to consume three to four cups of coffee per day and that doing so may actually reduce the risk of certain health conditions.\n\nThe study authors warned, however, that smoking may cancel out any benefits of drinking coffee.\n\nCaffeine is an important feature of coffee, but coffee contains many compounds, and there are different ways of drinking it. This makes it difficult to determine exactly how coffee affects a person and which components have benefits and risks.\n\nA person who wishes to derive health benefits from coffee consumption should avoid exceeding the daily recommended intake and try to monitor the ingredients they add — such as sugar, cream, and flavorings — as these may not be healthy.\n\nPregnant people and those at risk of bone fractures may wish to avoid coffee.\n\nShare this article\n\nSome studies have shown that caffeine can benefit overall health. However, others suggest that it may be harmful in excess. Read more to find out…\n\nGreen tea may benefit the heart, aid weight management, and soothe the skin. Learn more about the potential benefits and risks here.\n\nDo you often feel sluggish and would like to give your energy levels a boost? Read this Spotlight for research-backed suggestions on how to achieve…\n\nDo you enjoy tea for its flavor or the soothing feeling brought by holding a steaming cup? In this Spotlight, we tell you which brews are best for…\n\nThe macronutrients that trigger the most insulin release may vary from person to person, a new study finds, contradicting the belief that carbs cause…\n\nOUR BRANDS"
    },
    {
        "title": "Blue Bottle Coffee | Fresh Roasted Specialty Coffee",
        "url": "https://bluebottlecoffee.com/",
        "description": "Blue Bottle Coffee is a specialty coffee roaster with cafes in LA, SF, NYC, & Japan. Shop our freshly roasted specialty coffee online & in-store.",
        "text": "Shop Our Newest Buna Tetu Craft Instant | Free Shipping on Subscriptions and Orders Over $40\n\nUsed at Our Cafes in Japan, This Two-Glass Set Is Designed to Savor Cold Drinks All Summer and All Year Long\n\nCraft Instant Espresso Multiserve\n\nDark Chocolate, Molasses, Toasted Malt\n\nCraft Matcha\n\nCeremonial Grade and Stone-Milled from Uji, Japan\n\nBuna Tetu Craft Instant Coffee\n\nCocoa, molasses, dried cherry\n\nCraft Instant Espresso Single Serve\n\nDark Chocolate, Molasses, Toasted Malt\n\nHayes Valley Espresso\n\nBaking chocolate, orange zest, brown sugar\n\nGiant Steps\n\nCocoa, toasted marshmallow, graham cracker\n\n17ft Ceiling\n\nCaramel, almond, dried cherry\n\nClear Cold Tumbler\n\n16 oz Reusable and Durable Tumbler with Our Iconic Blue Straw\n\nFellow Carter Move Mug, 16 oz\n\nA Travel Mug That Does It All\n\nMoheim Stone Mug\n\nHandmade by Artisan Crafters In Vietnam\n\nSubminimal NanoFoamer V2\n\nMake velvety, cafe-quality latte foam at home\n\nBlue Bottle Pour Over Kit\n\nBlue Bottle pour overs, at home\n\nHario Cold Brew Bottle\n\nFuss-free cold brew, overnight\n\nFellow Stagg EKG Pour-Over Kettle in Fog Grey\n\nAn overperformer in every way\n\nJoin the waitlist to experience our latest Exceedingly Rare offering—a wild and vivacious coffee from the one and only Mauricio Shattah in Colombia.\n\nExperience the world’s most beautiful coffees through a Blue Bottle Coffee Subscription\n\nExceptional coffee, roasted daily to order in small batches, then shipped directly to you\n\nDelivered on your schedule—skip, change, cancel, or pause anytime\n\nWe build long-term relationships with producers who have high traceability\n\nNo machines, no maintenance, no mess–just a spoon. Take it anywhere for delicious lattes in seconds.\n\nWe put all of our obsessive expertise into capturing the nuances and flavors we demand out of our coffee.\n\n3 years of experimentation led us to a new method for creating instant coffee that is on par with our cafe drinks.\n\nHow to make your own creamy, dreamy, and always delicious NOLA Iced Coffee at home.\n\nOur go-to method: the Hario Cold Brew Bottle. All you need is coffee, water, and time.\n\nJoin our email newsletter for exclusive offers, Blue Bottle news, events, and first access to our most exciting releases. Plus, get complimentary shipping on your first purchase when you sign up.\n\nWe use cookies and other technologies to improve our site, personalize your experience, monitor and record your engagement with us, and share limited personal information with third-party advertisers. Your use of this site signals your agreement.\n\nSee\n\nYour Privacy Choices\n\nfor opt out options."
    },
    {
        "title": "What is Coffee?",
        "url": "https://www.ncausa.org/About-Coffee/What-is-Coffee",
        "description": "Coffea Arabica is descended from the original coffee trees discovered in Ethiopia. These trees produce a fine, mild, aromatic coffee and represent approximately ...",
        "text": "About NCA|Newsroom|Partner with NCA|Blog|Careers\n\n\n\n\n\nUser Login\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\r\n                    |\nCart\n\r\n                    |Join NCA!\n\n\nImage credit: USDA via Wikimedia Commons\n\nEveryone recognizes a roasted coffee bean, but you might not recognize an actual coffee plant.\n\nCoffee trees are pruned short to conserve their energy and aid in harvesting, but can grow to more than 30 feet (9 meters) high. Each tree is covered with green, waxy leaves growing opposite each other in pairs. Coffee cherries grow along the branches. Because it grows in a continuous cycle, it’s not unusual to see flowers, green fruit and ripe fruit simultaneously on a single tree.\n\nIt takes nearly a year for a cherry to mature after first flowering, and about 5 years of growth to reach full fruit production. While coffee plants can live up to 100 years, they are generally the most productive between the ages of 7 and 20. Proper care can maintain and even increase their output over the years, depending on the variety. The average coffee tree produces 10 pounds of coffee cherry per year, or 2 pounds of green beans.\n\nAll commercially grown coffee is from a region of the world called the Coffee Belt. The trees grow best in rich soil, with mild temperatures, frequent rain and shaded sun.\n \n\nCoffee traces its origin to a genus of plants known as Coffea.  Within the genus there are over 500 genera and 6,000 species of tropical trees and shrubs. Experts estimate that there are anywhere from 25 to 100 species of coffee plants.\n\nThe genus was first described in the 18th century by the Swedish botanist, Carolus Linneaus, who also described Coffea Arabica in his Species Plantarum in 1753. Botanists have disagreed ever since on the exact classification, since coffee plants can range widely. They can be small shrubs to tall trees, with leaves from one to 16 inches in size, and in colors from purple or yellow to the predominant dark green.\n\nIn the commercial coffee industry, there are two important coffee species — Arabica and Robusta.\n\nVarieties: Bourbon, Typica, Caturra, Mundo Novo, Tico, San Ramon, Jamaican Blue Mountain\n\nCoffea Arabica is descended from the original coffee trees discovered in Ethiopia.  These trees produce a fine, mild, aromatic coffee and represent approximately 70% of the world's coffee production. The beans are flatter and more elongated than Robusta and lower in caffeine.\n\nOn the world market, Arabica coffees bring the highest prices.  The better Arabicas are high grown coffees — generally grown between 2,000 to 6,000 feet (610 to 1830 meters) above sea level — though optimal altitude varies with proximity to the equator. \n\nThe most important factor is that temperatures must remain mild, ideally between 59 - 75 degrees Fahrenheit, with about 60 inches of rainfall a year. The trees are hearty, but a heavy frost will kill them.  \n\nArabica trees are costly to cultivate because the ideal terrain tends to be steep and access is difficult. Also, because the trees are more disease-prone than Robusta, they require additional care and attention. \n\nVariety: Robusta\n\nMost of the world's Robusta is grown in Central and Western Africa, parts of Southeast Asia, including Indonesia and Vietnam, and in Brazil. Production of Robusta is increasing, though it accounts for only about 30% of the world market. \n\nRobusta is primarily used in blends and for instant coffees. The Robusta bean itself tends to be slightly rounder and smaller than an Arabica bean.  \n\nThe Robusta tree is heartier and more resistant to disease and parasites, which makes it easier and cheaper to cultivate. It also has the advantage of being able to withstand warmer climates, preferring constant temperatures between 75 and 85 degrees Fahrenheit, which enables it to grow at far lower altitudes than Arabica.  \n\nIt requires about 60 inches of rainfall a year, and cannot withstand frost. Compared with Arabica, Robusta beans produce a coffee which has a distinctive taste and about 50-60% more caffeine.  \n\nThe beans you brew are actually the processed and roasted seeds from a fruit, which is called a coffee cherry.\n\nThe coffee cherry's outer skin is called the exocarp. Beneath it is the mesocarp, a thin layer of pulp, followed by a slimy layer called the parenchyma.  The beans themselves are covered in a paper-like envelope named the endocarp, more commonly referred to as the parchment.  \n\nInside the parchment, side-by-side, lie two beans, each covered separately by yet another thin membrane. The biological name for this seed skin is the spermoderm, but it is generally referred to in the coffee trade as the silver skin.\n\n\n\nIn about 5% of the world's coffee, there is only one bean inside the cherry. This is called a peaberry (or a caracol, or \"snail\" in Spanish), and it is a natural mutation. Some people believe that peaberries are actually sweeter and more flavorful than standard beans, so they are sometimes manually sorted out for special sale.\n \n\n\n\n\nImage credits: Lilibeth Serrano - USFWS via Wikimedia Commons, Wikimedia Commons, Michael C. Wright via Wikimedia Commons\n\n\n\n\n\n© National Coffee Association of U.S.A., Inc.\n\n45 Broadway, Suite 1140, New York, NY 10006\n\nPhone: 212 766-4007   Fax: 212 766-5815\n"
    },
    {
        "title": "Blanchard's Coffee Roasting Company",
        "url": "https://blanchardscoffee.com/",
        "description": "Craft Coffee Roasting in Richmond, Virginia.",
        "text": "Subscribe to your favorite blend or join one of our premium subscriptions to save money and never run out again.Learn more\n\nLive in Richmond, VA? Stop by any one of our cafes to grab your favorite blend or our latest releases.Plan Your Visit\n\nEnjoy your coffee outside! Each of our cafes offer a patio to enjoy your coffee under the sun with friends.Plan Your Visit\n\nSave time and order your favorite coffee or one of our speciality drinks ahead and we'll have it ready when you arrive.Order Pickup\n\nSubscribe to your favorite blend or join one of our premium subscriptions to save money and never run out again.Learn more\n\nLive in Richmond, VA? Stop by any one of our cafes to grab your favorite blend or our latest releases.Plan Your Visit\n\nEnjoy your coffee outside! Each of our cafes offer a patio to enjoy your coffee under the sun with friends.Plan Your Visit\n\nSave time and order your favorite coffee or one of our speciality drinks ahead and we'll have it ready when you arrive.Order Pickup\n\nBundle And Save\n\nBe the first to know about our latest releases, special offers, and all the news surround our Richmond cafes.\n\nRoasted In Richmond, VA\n\nSince 2005"
    },
    {
        "title": "Caribou Coffee® | Life Is Short. Stay Awake For It®",
        "url": "https://www.cariboucoffee.com/",
        "description": "Caribou Coffee® is more than a premium coffeehouse featuring high-quality, handcrafted beverages and food. Explore our menu, sign up for Caribou Coffee® ...",
        "text": null
    }
]